Autodesk.Revit.DB.Structure.ReinforcementSettings.RebarVaryingLengthNumberSuffix
A unique identifier used for a bar within a variable length rebar set.
Remarks:
This property is assigned to rebar sets with varying length bars only if they are numbered as a whole
(i.e. Autodesk.Revit.DB.Structure.ReinforcementSettings.NumberVaryingLengthRebarsIndividually is set to false).
The values for this property are valid if :
Input contains at least one character.Input contains either alphabetical or numeric characters (not both).
When this property is used, each bar in a set with varying length bars will be assigned an incremented value of the suffix.
As an example, the suffix values for three bars in a varying set are:
For alphabetic suffix : Aaz -> Aba -> Abb.For numeric suffix : 129 -> 130 -> 131.
These values are automatically incremented by the system.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The rebar number suffix is not valid if :
Input is empty.Input contains non-alphanumeric characters.Input contains both numeric and alphabetic characters.Input is a value that exceeds the maximum  integer representation.Input contains more than 6 alphabetic characters.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2017

Autodesk.Revit.DB.Structure.ReinforcementSettings.NumberVaryingLengthRebarsIndividually
Use this option to modify the way varying length bars are numbered (individually or as a whole).
Remarks:
If this property is true, then the Revit numbering mechanism (Autodesk.Revit.DB.NumberingSchema)
will assign a number to each bar in a rebar set with varying lengths. It will also assign a number to the sets that don't have varying length bars.
The number is assigned based on the Revit numbering logic. (For example if two bars are identical, they will receive the same number).
The numbering mechanism will compare varying bars with other varying or uniform bars within the project. (i.e each bar in a varying set is interpreted as an individual Rebar).
The shape parameters of a Rebar can be accessed via Autodesk::Revit::DB::Structure::RebarShapeDefinition::getParameters method.
The parameters at a specific index in a Rebar set can be accessed via Autodesk::Revit::DB::Structure::Rebar::getParameterValueAtIndex method.
If this property is false, the following happens:
1. The Revit numbering mechanism (Autodesk.Revit.DB.NumberingSchema)
will assign a unique number for each Rebar set which has varying length bars.
Each bar within the varying set will have(share) the same number that was assigned for the entire set.
Even if two varying Rebar sets are identical, they will be assigned different numbers.2. Each bar within a set with varying length bars will also be assigned a suffix parameter (REBAR_NUMBER_SUFFIX).
This suffix parameter will receive values based on the Autodesk.Revit.DB.Structure.ReinforcementSettings.RebarVaryingLengthNumberSuffix property.
Since:
2017